{
  "architectures": [
    "Qwen2ForCausalLM"
  ],
  "model_type": "qwen2",
  "model_name": "Stack-2.9-finetuned",
  "vocab_size": 151936,
  "hidden_size": 1536,
  "num_hidden_layers": 28,
  "num_attention_heads": 12,
  "num_key_value_heads": 2,
  "intermediate_size": 8960,
  "max_position_embeddings": 131072,
  "rope_scaling": {
    "type": "ntk",
    "factor": 4.0
  },
  "rope_theta": 1000000.0,
  "hidden_act": "silu",
  "rms_norm_eps": 1e-06,
  "bos_token_id": 151643,
  "eos_token_id": 151643,
  "pad_token_id": null,
  "tie_word_embeddings": true,
  "use_cache": true,
  "torch_dtype": "float32",
  "transformers_version": "5.5.0"
}